99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_mesh/esp32_mquickjs_wifi_mesh.c
bool esp32_mquickjs_init_wifi_mesh_runtime(JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref, object_ref, proto_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *proto = JS_PushGCRef(ctx, &proto_ref), *method = JS_PushGCRef(ctx, &method_ref);
    bool ok = false;
    *global = JS_GetGlobalObject(ctx); if (JS_IsException(*global)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "WiFiMeshSession"); if (JS_IsException(*object)) goto done;
    *proto = JS_GetPropertyStr(ctx, *object, "prototype"); if (JS_IsException(*proto)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "ready");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_ready_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "close");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_close_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "recover");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_recover_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "receive");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_receive_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "send");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_send_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "routingTable");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_routing_table_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "groups");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_groups_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "addGroups");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_add_groups_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "removeGroups");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_remove_groups_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setToDSState");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_tods_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "connect");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_connect_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "disconnect");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_disconnect_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "flushUpstream");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_flush_upstream_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "configuration");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_configuration_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setRouter");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_router_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setMeshId");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_mesh_id_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setType");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_type_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setSelfOrganized");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_self_organized_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setFixedRoot");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_fixed_root_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setRootConflicts");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_root_conflicts_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setAssociationExpiry");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_association_expiry_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setRootHealingDelay");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_root_healing_delay_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setIEEncryption");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_ie_encryption_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "waiveRoot");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_waive_root_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "switchChannel");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_switch_channel_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setDeviceDuty");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_device_duty_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setNetworkDuty");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_network_duty_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "signalDuty");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_signal_duty_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "subnet");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_subnet_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "hasGroup");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_has_group_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "upstreamCapacity");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_upstream_capacity_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "powerStatus");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_power_status_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "tsfTime");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_tsf_time_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "setParent");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_set_parent_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "scan");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_scan_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "receiveScan");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_receive_scan_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "flushScan");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_mesh_flush_scan_driver)) goto done;
    ok = true;
done:
    if (!ok && !JS_HasException(ctx)) JS_ThrowInternalError(ctx, "failed to register Mesh runtime");
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &proto_ref);
    JS_PopGCRef(ctx, &object_ref); JS_PopGCRef(ctx, &global_ref); return ok;
}
#endif
